// let num = 3;
// alert(num);

// let a = 10;
// let b = 2;
// alert(a + b);
// alert(a - b);
// alert(a * b);
// alert(a / b);
// Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.
// let c = 15;
// let d = 2;
// let result = c + d;
// alert(result);

 // Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.

// let a = 10;
// let b = 2;
// let c = 5;
// alert(a + b + c);

// Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.

// let a = 17;
// let b = 10;
// let c = a - b;
// let d = 7;
// let result = c + d;
// alert(result);






// Создайте переменную str и присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной на экран.
// let str = 'Привет, Мир!';
// alert(str);

//  Создайте переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.

// let str1 = 'Привет';
// let str2 = 'Мир!';
// alert(`${str1} ${str2}`);

//  Создайте переменную name и присвойте ей ваше имя. Выведите на экран фразу 'Привет, %Имя%!'.
// let  name = 'Богдан';
// alert('Привет, ' + name);

//  Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'.
// let age = 20;
// alert('Мне ' + age + ' лет!');




// Спросите имя пользователя с помощью методы prompt. Выведите с помощью alert сообщение 'Ваше имя %имя%'.
// let name = prompt('Ведите имя');
// alert('Ваше имя ' + name);

  // Спросите у пользователя число. Выведите с помощью alert квадрат этого числа.
// let number = prompt('Ведите число');
// alert(number * number);



// Создайте переменную str и присвойте ей значение 'abcde'. Обращаясь к отдельным символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'.
// let str = 'abcde';
// alert(str[0]);
// alert(str[2]);
// alert(str[4]);


//  Создайте переменную num и присвойте ей значение '12345'. Найдите произведение (умножение) цифр этого числа.

// let num = '12345';
//  alert((num[0]) * (num[1]) * (num[2]) * (num[3]) * (num[4]));






// Напишите скрипт, который считает количество секунд в часе, в сутках, в месяце.

// let hours = +prompt('Ведите число');
// let day = +prompt('Ведите число');
//  let result = hours * 60;

// let secondHours = 60 * result;
// let secondDay = 24 * secondHours;
// let secondMonth = day * secondDay;

// alert(secondHours);
// alert(secondDay);
// alert(secondMonth);


//  Создайте три переменные - час, минута, секунда. С их помощью выведите текущее время в формате 'час:минута:секунда'.

// let hour = 20;
// let minute = 25;
// let second = 30;
// alert('час:' + hour + 'минута:' + minute + 'секунда' + second);


//  Создайте переменную, присвойте ей число. Возведите это число в квадрат. Выведите его на экран.

// let a = 12; 
// let result = a * a;
// alert(result);

// var num = 47;
// num += 7;
// num -= 18;
// num *= 10;
// num /=  15;
// alert(num);

// var num = 10;
// num++;
// num++;
// num--;
// alert(num);